Autodesk.Revit.DB.AssemblyMemberDifferentType.TypeId2
Type id of the second assembly member
Since:
2012

Autodesk.Revit.DB.AssemblyMemberDifferentType.TypeId1
Type id of the first assembly member
Since:
2012

Autodesk.Revit.DB.AssemblyMemberDifferentType
The two assembly members being compared have different type
Since:
2012